[NoCoverage] BlockStatement
src/lib/nutrition.ts:24:49
 
 export class NutritionApiError extends Error {
   status?: number;
-  constructor(message: string, status?: number) {
-    super(message);
-    this.name = "NutritionApiError";
-    this.status = status;
-  }
+  constructor(message: string, status?: number) {}
 }
 

[Killed] BlockStatement
src/lib/nutrition.ts:60:52
 
 const OFF_SEARCH = "https://search.openfoodfacts.org/search";
 
-function num(v: number | undefined): NutrientValue {
-  return typeof v === "number" && isFinite(v) ? v : "missing";
-}
+function num(v: number | undefined): NutrientValue {}
 
 function extractNutrients(p: OFFProduct): IngredientNutrients {
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected NaN to be 165 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:61:10
 const OFF_SEARCH = "https://search.openfoodfacts.org/search";
 
 function num(v: number | undefined): NutrientValue {
-  return typeof v === "number" && isFinite(v) ? v : "missing";
+  return true ? v : "missing";
 }
 
killedBy: fetchNutrients Risk #1 — non-macro absent in fixture produces "missing"
statusReason: expected NaN to be 'missing' // Object.is equality

[Killed] EqualityOperator
src/lib/nutrition.ts:61:10
 const OFF_SEARCH = "https://search.openfoodfacts.org/search";
 
 function num(v: number | undefined): NutrientValue {
-  return typeof v === "number" && isFinite(v) ? v : "missing";
+  return typeof v !== "number" && isFinite(v) ? v : "missing";
 }
 
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] BlockStatement
src/lib/nutrition.ts:64:63
   return typeof v === "number" && isFinite(v) ? v : "missing";
 }
 
-function extractNutrients(p: OFFProduct): IngredientNutrients {
-  const n = p.nutriments ?? {};
-  // OFF stores sodium in grams; derive from salt if sodium absent
-  const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
-  const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
-
-  return {
-    energy:       num(n["energy-kcal_100g"]),
-    protein:      num(n.proteins_100g),
-    fat:          num(n.fat_100g),
-    saturatedFat: num(n["saturated-fat_100g"]),
-    carbs:        num(n.carbohydrates_100g),
-    fiber:        num(n.fiber_100g),
-    sugars:       num(n.sugars_100g),
-    salt:         num(n.salt_100g),
-    sodium:       num(sodiumMg),
-  };
-}
+function extractNutrients(p: OFFProduct): IngredientNutrients {}
 
 const EMPTY_NUTRIENTS: IngredientNutrients = {
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: Cannot read properties of undefined (reading 'energy')

[Killed] LogicalOperator
src/lib/nutrition.ts:65:13
 }
 
 function extractNutrients(p: OFFProduct): IngredientNutrients {
-  const n = p.nutriments ?? {};
+  const n = p.nutriments && {};
   // OFF stores sodium in grams; derive from salt if sodium absent
   const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Survived] ConditionalExpression
src/lib/nutrition.ts:67:37
 function extractNutrients(p: OFFProduct): IngredientNutrients {
   const n = p.nutriments ?? {};
   // OFF stores sodium in grams; derive from salt if sodium absent
-  const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
+  const sodiumG = n.sodium_100g ?? (false ? n.salt_100g / 2.5 : undefined);
   const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
 

[Survived] EqualityOperator
src/lib/nutrition.ts:67:37
 function extractNutrients(p: OFFProduct): IngredientNutrients {
   const n = p.nutriments ?? {};
   // OFF stores sodium in grams; derive from salt if sodium absent
-  const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
+  const sodiumG = n.sodium_100g ?? (n.salt_100g == null ? n.salt_100g / 2.5 : undefined);
   const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
 

[Killed] EqualityOperator
src/lib/nutrition.ts:68:20
   const n = p.nutriments ?? {};
   // OFF stores sodium in grams; derive from salt if sodium absent
   const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
-  const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
+  const sodiumMg = sodiumG == null ? sodiumG * 1000 : undefined;
 
   return {
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected 'missing' to be 80 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:68:20
   const n = p.nutriments ?? {};
   // OFF stores sodium in grams; derive from salt if sodium absent
   const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
-  const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
+  const sodiumMg = false ? sodiumG * 1000 : undefined;
 
   return {
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected 'missing' to be 80 // Object.is equality

[Killed] ObjectLiteral
src/lib/nutrition.ts:70:10
   const sodiumG = n.sodium_100g ?? (n.salt_100g != null ? n.salt_100g / 2.5 : undefined);
   const sodiumMg = sodiumG != null ? sodiumG * 1000 : undefined;
 
-  return {
-    energy:       num(n["energy-kcal_100g"]),
-    protein:      num(n.proteins_100g),
-    fat:          num(n.fat_100g),
-    saturatedFat: num(n["saturated-fat_100g"]),
-    carbs:        num(n.carbohydrates_100g),
-    fiber:        num(n.fiber_100g),
-    sugars:       num(n.sugars_100g),
-    salt:         num(n.salt_100g),
-    sodium:       num(sodiumMg),
-  };
+  return {};
 }
 
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected NaN to be 165 // Object.is equality

[Killed] StringLiteral
src/lib/nutrition.ts:87:17
   energy: 0,
   protein: 0,
   fat: 0,
-  saturatedFat: "missing",
+  saturatedFat: "",
   carbs: 0,
   fiber: "missing",
killedBy: fetchNutrients zero products — returns EMPTY_NUTRIENTS shape
statusReason: expected '' to be 'missing' // Object.is equality

[Survived] StringLiteral
src/lib/nutrition.ts:90:11
   saturatedFat: "missing",
   carbs: 0,
   fiber: "missing",
-  sugars: "missing",
+  sugars: "",
   salt: "missing",
   sodium: "missing",

[Killed] BlockStatement
src/lib/nutrition.ts:97:24
 
 export function aggregateNutrients(
   results: IngredientNutrients[],
-): IngredientNutrients {
-  if (results.length === 0) {
-    throw new Error("aggregateNutrients requires at least one element");
-  }
-  const keys = Object.keys(results[0]) as (keyof IngredientNutrients)[];
-  return Object.fromEntries(
-    keys.map((key) => {
-      const values = results.map((r) => r[key]);
-      const total: NutrientValue = values.some((v) => v === "missing")
-        ? "missing"
-        : (values as number[]).reduce((sum, v) => sum + v, 0);
-      return [key, total];
-    }),
-  ) as unknown as IngredientNutrients;
-}
+): IngredientNutrients {}
 
 export async function fetchNutrients(
killedBy: aggregateNutrients sums all numeric fields across two ingredients
statusReason: Cannot read properties of undefined (reading 'energy')

[Killed] EqualityOperator
src/lib/nutrition.ts:98:7
 export function aggregateNutrients(
   results: IngredientNutrients[],
 ): IngredientNutrients {
-  if (results.length === 0) {
+  if (results.length !== 0) {
     throw new Error("aggregateNutrients requires at least one element");
   }
killedBy: aggregateNutrients sums all numeric fields across two ingredients
statusReason: aggregateNutrients requires at least one element

[Killed] ConditionalExpression
src/lib/nutrition.ts:98:7
 export function aggregateNutrients(
   results: IngredientNutrients[],
 ): IngredientNutrients {
-  if (results.length === 0) {
+  if (true) {
     throw new Error("aggregateNutrients requires at least one element");
   }
killedBy: aggregateNutrients sums all numeric fields across two ingredients
statusReason: aggregateNutrients requires at least one element

[Survived] StringLiteral
src/lib/nutrition.ts:99:21
   results: IngredientNutrients[],
 ): IngredientNutrients {
   if (results.length === 0) {
-    throw new Error("aggregateNutrients requires at least one element");
+    throw new Error("");
   }
   const keys = Object.keys(results[0]) as (keyof IngredientNutrients)[];

[Killed] StringLiteral
src/lib/nutrition.ts:118:21
   weightGrams?: number,
 ): Promise<IngredientNutrients> {
   // Step 1: search Open Food Facts — fetch top 10 candidates.
-  const searchUrl = `${OFF_SEARCH}?q=${encodeURIComponent(ingredientValue)}&page_size=10&fields=code,product_name,brands,nutriments&json=1`;
+  const searchUrl = ``;
 
   let searchRes: Response;
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: Open Food Facts search request failed: Failed to parse URL from

[Killed] BlockStatement
src/lib/nutrition.ts:121:7
   const searchUrl = `${OFF_SEARCH}?q=${encodeURIComponent(ingredientValue)}&page_size=10&fields=code,product_name,brands,nutriments&json=1`;
 
   let searchRes: Response;
-  try {
-    searchRes = await fetch(searchUrl, {
-      headers: { "User-Agent": "NutriCalc/1.0 (natalia.kuczma@noaignite.com)" },
-    });
-  } catch (err) {
+  try {} catch (err) {
     throw new NutritionApiError(
       `Open Food Facts search request failed: ${err instanceof Error ? err.message : String(err)}`,
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: Cannot read properties of undefined (reading 'ok')

[Survived] StringLiteral
src/lib/nutrition.ts:123:32
   let searchRes: Response;
   try {
     searchRes = await fetch(searchUrl, {
-      headers: { "User-Agent": "NutriCalc/1.0 (natalia.kuczma@noaignite.com)" },
+      headers: { "User-Agent": "" },
     });
   } catch (err) {

[Survived] ObjectLiteral
src/lib/nutrition.ts:123:16
   let searchRes: Response;
   try {
     searchRes = await fetch(searchUrl, {
-      headers: { "User-Agent": "NutriCalc/1.0 (natalia.kuczma@noaignite.com)" },
+      headers: {},
     });
   } catch (err) {

[NoCoverage] BlockStatement
src/lib/nutrition.ts:125:17
     searchRes = await fetch(searchUrl, {
       headers: { "User-Agent": "NutriCalc/1.0 (natalia.kuczma@noaignite.com)" },
     });
-  } catch (err) {
-    throw new NutritionApiError(
-      `Open Food Facts search request failed: ${err instanceof Error ? err.message : String(err)}`,
-    );
-  }
+  } catch (err) {}
   if (!searchRes.ok) {
     throw new NutritionApiError(

[NoCoverage] StringLiteral
src/lib/nutrition.ts:127:7
     });
   } catch (err) {
     throw new NutritionApiError(
-      `Open Food Facts search request failed: ${err instanceof Error ? err.message : String(err)}`,
+      ``,
     );
   }

[Killed] ConditionalExpression
src/lib/nutrition.ts:130:7
       `Open Food Facts search request failed: ${err instanceof Error ? err.message : String(err)}`,
     );
   }
-  if (!searchRes.ok) {
+  if (true) {
     throw new NutritionApiError(
       `Open Food Facts search returned ${searchRes.status}`,
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: Open Food Facts search returned 200

[Killed] BooleanLiteral
src/lib/nutrition.ts:130:7
       `Open Food Facts search request failed: ${err instanceof Error ? err.message : String(err)}`,
     );
   }
-  if (!searchRes.ok) {
+  if (searchRes.ok) {
     throw new NutritionApiError(
       `Open Food Facts search returned ${searchRes.status}`,
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: Open Food Facts search returned 200

[Killed] LogicalOperator
src/lib/nutrition.ts:138:20
   }
 
   const searchData = (await searchRes.json()) as OFFSearchResponse;
-  const products = searchData.hits ?? searchData.products ?? [];
+  const products = searchData.hits && searchData.products ?? [];
   if (products.length === 0) {
     return EMPTY_NUTRIENTS;
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] LogicalOperator
src/lib/nutrition.ts:138:20
   }
 
   const searchData = (await searchRes.json()) as OFFSearchResponse;
-  const products = searchData.hits ?? searchData.products ?? [];
+  const products = (searchData.hits ?? searchData.products) && [];
   if (products.length === 0) {
     return EMPTY_NUTRIENTS;
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:139:7
 
   const searchData = (await searchRes.json()) as OFFSearchResponse;
   const products = searchData.hits ?? searchData.products ?? [];
-  if (products.length === 0) {
+  if (true) {
     return EMPTY_NUTRIENTS;
   }
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] EqualityOperator
src/lib/nutrition.ts:139:7
 
   const searchData = (await searchRes.json()) as OFFSearchResponse;
   const products = searchData.hits ?? searchData.products ?? [];
-  if (products.length === 0) {
+  if (products.length !== 0) {
     return EMPTY_NUTRIENTS;
   }
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Survived] BlockStatement
src/lib/nutrition.ts:145:20
 
   // Step 2: use AI to pick the best-matching product from the candidate list.
   const candidateList = products
-    .map((p, i) => {
-      const label = [p.product_name, p.brands].filter(Boolean).join(" — ") || "(no name)";
-      return `${i}: ${label} [code: ${p.code}]`;
-    })
+    .map((p, i) => {})
     .join("\n");
 

[Survived] MethodExpression
src/lib/nutrition.ts:146:21
   // Step 2: use AI to pick the best-matching product from the candidate list.
   const candidateList = products
     .map((p, i) => {
-      const label = [p.product_name, p.brands].filter(Boolean).join(" — ") || "(no name)";
+      const label = [p.product_name, p.brands].join(" — ") || "(no name)";
       return `${i}: ${label} [code: ${p.code}]`;
     })

[Survived] LogicalOperator
src/lib/nutrition.ts:146:21
   // Step 2: use AI to pick the best-matching product from the candidate list.
   const candidateList = products
     .map((p, i) => {
-      const label = [p.product_name, p.brands].filter(Boolean).join(" — ") || "(no name)";
+      const label = [p.product_name, p.brands].filter(Boolean).join(" — ") && "(no name)";
       return `${i}: ${label} [code: ${p.code}]`;
     })

[Survived] StringLiteral
src/lib/nutrition.ts:149:11
       const label = [p.product_name, p.brands].filter(Boolean).join(" — ") || "(no name)";
       return `${i}: ${label} [code: ${p.code}]`;
     })
-    .join("\n");
+    .join("");
 
   let chosenCode = products[0].code;

[Survived] ConditionalExpression
src/lib/nutrition.ts:153:7
 
   let chosenCode = products[0].code;
   const openrouterKey = process.env.OPENROUTER_API_KEY;
-  if (openrouterKey) {
+  if (true) {
     try {
       const openrouter = createOpenRouter({ apiKey: openrouterKey });

[NoCoverage] BlockStatement
src/lib/nutrition.ts:153:22
 
   let chosenCode = products[0].code;
   const openrouterKey = process.env.OPENROUTER_API_KEY;
-  if (openrouterKey) {
-    try {
-      const openrouter = createOpenRouter({ apiKey: openrouterKey });
-      const { text } = await generateText({
-        model: openrouter("anthropic/claude-sonnet-4.6"),
-        prompt: `You are selecting the best Open Food Facts product match for a recipe ingredient.
-Ingredient: "${ingredientValue}"
-Candidates (index: name [code]):
-${candidateList}
-Reply with only a JSON object: {"code": "<product_code>"}`,
-      });
-      const match = text.match(/"code"\s*:\s*"([^"]+)"/);
-      if (match) {
-        const picked = match[1];
-        if (products.some((p) => p.code === picked)) {
-          chosenCode = picked;
-        }
-      }
-    } catch (err) {
-      console.warn(
-        `[nutrition] AI food selection failed for "${ingredientValue}", falling back to first result:`,
-        err instanceof Error ? err.message : err,
-      );
-    }
-  }
+  if (openrouterKey) {}
 
   // Step 3: extract nutrients from the chosen product.

[NoCoverage] BlockStatement
src/lib/nutrition.ts:154:9
   let chosenCode = products[0].code;
   const openrouterKey = process.env.OPENROUTER_API_KEY;
   if (openrouterKey) {
-    try {
-      const openrouter = createOpenRouter({ apiKey: openrouterKey });
-      const { text } = await generateText({
-        model: openrouter("anthropic/claude-sonnet-4.6"),
-        prompt: `You are selecting the best Open Food Facts product match for a recipe ingredient.
-Ingredient: "${ingredientValue}"
-Candidates (index: name [code]):
-${candidateList}
-Reply with only a JSON object: {"code": "<product_code>"}`,
-      });
-      const match = text.match(/"code"\s*:\s*"([^"]+)"/);
-      if (match) {
-        const picked = match[1];
-        if (products.some((p) => p.code === picked)) {
-          chosenCode = picked;
-        }
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.warn(
         `[nutrition] AI food selection failed for "${ingredientValue}", falling back to first result:`,

[NoCoverage] Regex
src/lib/nutrition.ts:164:32
 ${candidateList}
 Reply with only a JSON object: {"code": "<product_code>"}`,
       });
-      const match = text.match(/"code"\s*:\s*"([^"]+)"/);
+      const match = text.match(/"code"\S*:\s*"([^"]+)"/);
       if (match) {
         const picked = match[1];

[NoCoverage] BlockStatement
src/lib/nutrition.ts:165:18
 Reply with only a JSON object: {"code": "<product_code>"}`,
       });
       const match = text.match(/"code"\s*:\s*"([^"]+)"/);
-      if (match) {
-        const picked = match[1];
-        if (products.some((p) => p.code === picked)) {
-          chosenCode = picked;
-        }
-      }
+      if (match) {}
     } catch (err) {
       console.warn(

[NoCoverage] ConditionalExpression
src/lib/nutrition.ts:165:11
 Reply with only a JSON object: {"code": "<product_code>"}`,
       });
       const match = text.match(/"code"\s*:\s*"([^"]+)"/);
-      if (match) {
+      if (false) {
         const picked = match[1];
         if (products.some((p) => p.code === picked)) {

[NoCoverage] ConditionalExpression
src/lib/nutrition.ts:167:34
       const match = text.match(/"code"\s*:\s*"([^"]+)"/);
       if (match) {
         const picked = match[1];
-        if (products.some((p) => p.code === picked)) {
+        if (products.some((p) => false)) {
           chosenCode = picked;
         }

[NoCoverage] BlockStatement
src/lib/nutrition.ts:167:54
       const match = text.match(/"code"\s*:\s*"([^"]+)"/);
       if (match) {
         const picked = match[1];
-        if (products.some((p) => p.code === picked)) {
-          chosenCode = picked;
-        }
+        if (products.some((p) => p.code === picked)) {}
       }
     } catch (err) {

[NoCoverage] BlockStatement
src/lib/nutrition.ts:171:19
           chosenCode = picked;
         }
       }
-    } catch (err) {
-      console.warn(
-        `[nutrition] AI food selection failed for "${ingredientValue}", falling back to first result:`,
-        err instanceof Error ? err.message : err,
-      );
-    }
+    } catch (err) {}
   }
 

[Survived] EqualityOperator
src/lib/nutrition.ts:181:26
 
   // Step 3: extract nutrients from the chosen product.
   const chosenProduct =
-    products.find((p) => p.code === chosenCode) ?? products[0];
+    products.find((p) => p.code !== chosenCode) ?? products[0];
   const label = [chosenProduct.product_name, chosenProduct.brands].filter(Boolean).join(" — ");
   console.log(`[nutrition] chosen product: ${label} (${chosenProduct.code})`);

[Survived] ConditionalExpression
src/lib/nutrition.ts:181:26
 
   // Step 3: extract nutrients from the chosen product.
   const chosenProduct =
-    products.find((p) => p.code === chosenCode) ?? products[0];
+    products.find((p) => true) ?? products[0];
   const label = [chosenProduct.product_name, chosenProduct.brands].filter(Boolean).join(" — ");
   console.log(`[nutrition] chosen product: ${label} (${chosenProduct.code})`);

[Survived] MethodExpression
src/lib/nutrition.ts:182:17
   // Step 3: extract nutrients from the chosen product.
   const chosenProduct =
     products.find((p) => p.code === chosenCode) ?? products[0];
-  const label = [chosenProduct.product_name, chosenProduct.brands].filter(Boolean).join(" — ");
+  const label = [chosenProduct.product_name, chosenProduct.brands].join(" — ");
   console.log(`[nutrition] chosen product: ${label} (${chosenProduct.code})`);
 

[Survived] StringLiteral
src/lib/nutrition.ts:182:89
   // Step 3: extract nutrients from the chosen product.
   const chosenProduct =
     products.find((p) => p.code === chosenCode) ?? products[0];
-  const label = [chosenProduct.product_name, chosenProduct.brands].filter(Boolean).join(" — ");
+  const label = [chosenProduct.product_name, chosenProduct.brands].filter(Boolean).join("");
   console.log(`[nutrition] chosen product: ${label} (${chosenProduct.code})`);
 

[Killed] EqualityOperator
src/lib/nutrition.ts:188:40
   const raw = extractNutrients(chosenProduct);
 
   const scale =
-    typeof weightGrams === "number" && weightGrams > 0
+    typeof weightGrams === "number" && weightGrams <= 0
       ? weightGrams / 100
       : null;
killedBy: fetchNutrients Risk #2 — scaling — returns correct values for 200g
statusReason: expected 165 to be 330 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:188:5
   const raw = extractNutrients(chosenProduct);
 
   const scale =
-    typeof weightGrams === "number" && weightGrams > 0
+    false
       ? weightGrams / 100
       : null;
killedBy: fetchNutrients Risk #2 — scaling — returns correct values for 200g
statusReason: expected 165 to be 330 // Object.is equality

[Killed] ArithmeticOperator
src/lib/nutrition.ts:189:9
 
   const scale =
     typeof weightGrams === "number" && weightGrams > 0
-      ? weightGrams / 100
+      ? weightGrams * 100
       : null;
 
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected 1650000 to be 165 // Object.is equality

[Killed] BlockStatement
src/lib/nutrition.ts:192:56
       ? weightGrams / 100
       : null;
 
-  function scaled(value: NutrientValue): NutrientValue {
-    if (scale === null || value === "missing") return value;
-    return value * scale;
-  }
+  function scaled(value: NutrientValue): NutrientValue {}
 
   // For core macros absent from OFF, fall back to 0 rather than "missing".
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected undefined to be 165 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:193:9
       : null;
 
   function scaled(value: NutrientValue): NutrientValue {
-    if (scale === null || value === "missing") return value;
+    if (false) return value;
     return value * scale;
   }
killedBy: fetchNutrients Risk #1 — non-macro absent in fixture produces "missing"
statusReason: expected NaN to be 'missing' // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:193:9
       : null;
 
   function scaled(value: NutrientValue): NutrientValue {
-    if (scale === null || value === "missing") return value;
+    if (true) return value;
     return value * scale;
   }
killedBy: fetchNutrients Risk #2 — scaling — returns correct values for 200g
statusReason: expected 165 to be 330 // Object.is equality

[Killed] ArithmeticOperator
src/lib/nutrition.ts:194:12
 
   function scaled(value: NutrientValue): NutrientValue {
     if (scale === null || value === "missing") return value;
-    return value * scale;
+    return value / scale;
   }
 
killedBy: fetchNutrients Risk #2 — scaling — returns correct values for 200g
statusReason: expected 82.5 to be 330 // Object.is equality

[Killed] BlockStatement
src/lib/nutrition.ts:198:61
   }
 
   // For core macros absent from OFF, fall back to 0 rather than "missing".
-  function scaledMacro(value: NutrientValue): NutrientValue {
-    if (value === "missing") return 0;
-    return scaled(value);
-  }
+  function scaledMacro(value: NutrientValue): NutrientValue {}
 
   return {
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected undefined to be 165 // Object.is equality

[Killed] EqualityOperator
src/lib/nutrition.ts:199:9
 
   // For core macros absent from OFF, fall back to 0 rather than "missing".
   function scaledMacro(value: NutrientValue): NutrientValue {
-    if (value === "missing") return 0;
+    if (value !== "missing") return 0;
     return scaled(value);
   }
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] ConditionalExpression
src/lib/nutrition.ts:199:9
 
   // For core macros absent from OFF, fall back to 0 rather than "missing".
   function scaledMacro(value: NutrientValue): NutrientValue {
-    if (value === "missing") return 0;
+    if (true) return 0;
     return scaled(value);
   }
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected +0 to be 165 // Object.is equality

[Killed] ObjectLiteral
src/lib/nutrition.ts:203:10
     return scaled(value);
   }
 
-  return {
-    energy:       scaledMacro(raw.energy),
-    protein:      scaledMacro(raw.protein),
-    fat:          scaledMacro(raw.fat),
-    saturatedFat: scaled(raw.saturatedFat),
-    carbs:        scaledMacro(raw.carbs),
-    fiber:        scaled(raw.fiber),
-    sugars:       scaled(raw.sugars),
-    salt:         scaled(raw.salt),
-    sodium:       scaled(raw.sodium),
-  };
+  return {};
 }
 
killedBy: fetchNutrients Risk #2 — returns correct numeric values for known fixture at 100g
statusReason: expected undefined to be 165 // Object.is equality
