[Killed] BlockStatement
src/lib/db/recipes.ts:20:62
   | "total_carbs" | "total_fiber" | "total_sugars" | "total_salt" | "total_sodium"
 >;
 
-function nullToMissing(v: number | null): number | "missing" {
-  return v === null ? "missing" : v;
-}
+function nullToMissing(v: number | null): number | "missing" {}
 
 function missingToNull(v: number | "missing"): number | null {
killedBy: ingredientRowToNutrients maps all null fields to "missing"
statusReason: expected undefined to be 'missing' // Object.is equality

[Killed] EqualityOperator
src/lib/db/recipes.ts:21:10
 >;
 
 function nullToMissing(v: number | null): number | "missing" {
-  return v === null ? "missing" : v;
+  return v !== null ? "missing" : v;
 }
 
killedBy: ingredientRowToNutrients maps all null fields to "missing"
statusReason: expected null to be 'missing' // Object.is equality

[Killed] ConditionalExpression
src/lib/db/recipes.ts:21:10
 >;
 
 function nullToMissing(v: number | null): number | "missing" {
-  return v === null ? "missing" : v;
+  return true ? "missing" : v;
 }
 
killedBy: ingredientRowToNutrients passes through numeric values unchanged
statusReason: expected 'missing' to be 165 // Object.is equality

[Killed] BlockStatement
src/lib/db/recipes.ts:24:62
   return v === null ? "missing" : v;
 }
 
-function missingToNull(v: number | "missing"): number | null {
-  return v === "missing" ? null : v;
-}
+function missingToNull(v: number | "missing"): number | null {}
 
 export function ingredientRowToNutrients(row: IngredientRow): IngredientNutrients {
killedBy: nutrientsToIngredientColumns maps "missing" to null for all fields
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/db/recipes.ts:25:10
 }
 
 function missingToNull(v: number | "missing"): number | null {
-  return v === "missing" ? null : v;
+  return false ? null : v;
 }
 
killedBy: nutrientsToIngredientColumns maps "missing" to null for all fields
statusReason: expected 'missing' to be null

[Killed] EqualityOperator
src/lib/db/recipes.ts:25:10
 }
 
 function missingToNull(v: number | "missing"): number | null {
-  return v === "missing" ? null : v;
+  return v !== "missing" ? null : v;
 }
 
killedBy: nutrientsToIngredientColumns maps "missing" to null for all fields
statusReason: expected 'missing' to be null

[Killed] BlockStatement
src/lib/db/recipes.ts:28:83
   return v === "missing" ? null : v;
 }
 
-export function ingredientRowToNutrients(row: IngredientRow): IngredientNutrients {
-  return {
-    energy:       nullToMissing(row.energy),
-    protein:      nullToMissing(row.protein),
-    fat:          nullToMissing(row.fat),
-    saturatedFat: nullToMissing(row.saturated_fat),
-    carbs:        nullToMissing(row.carbs),
-    fiber:        nullToMissing(row.fiber),
-    sugars:       nullToMissing(row.sugars),
-    salt:         nullToMissing(row.salt),
-    sodium:       nullToMissing(row.sodium),
-  };
-}
+export function ingredientRowToNutrients(row: IngredientRow): IngredientNutrients {}
 
 export function nutrientsToIngredientColumns(nutrients: IngredientNutrients): NutrientInsertColumns {
killedBy: ingredientRowToNutrients maps all null fields to "missing"
statusReason: Cannot read properties of undefined (reading 'energy')

[Killed] BlockStatement
src/lib/db/recipes.ts:42:101
   };
 }
 
-export function nutrientsToIngredientColumns(nutrients: IngredientNutrients): NutrientInsertColumns {
-  return {
-    energy:        missingToNull(nutrients.energy),
-    protein:       missingToNull(nutrients.protein),
-    fat:           missingToNull(nutrients.fat),
-    saturated_fat: missingToNull(nutrients.saturatedFat),
-    carbs:         missingToNull(nutrients.carbs),
-    fiber:         missingToNull(nutrients.fiber),
-    sugars:        missingToNull(nutrients.sugars),
-    salt:          missingToNull(nutrients.salt),
-    sodium:        missingToNull(nutrients.sodium),
-  };
-}
+export function nutrientsToIngredientColumns(nutrients: IngredientNutrients): NutrientInsertColumns {}
 
 export function recipeRowToTotals(row: RecipeRow): IngredientNutrients {
killedBy: nutrientsToIngredientColumns maps "missing" to null for all fields
statusReason: Cannot read properties of undefined (reading 'energy')

[Killed] ObjectLiteral
src/lib/db/recipes.ts:43:10
 }
 
 export function nutrientsToIngredientColumns(nutrients: IngredientNutrients): NutrientInsertColumns {
-  return {
-    energy:        missingToNull(nutrients.energy),
-    protein:       missingToNull(nutrients.protein),
-    fat:           missingToNull(nutrients.fat),
-    saturated_fat: missingToNull(nutrients.saturatedFat),
-    carbs:         missingToNull(nutrients.carbs),
-    fiber:         missingToNull(nutrients.fiber),
-    sugars:        missingToNull(nutrients.sugars),
-    salt:          missingToNull(nutrients.salt),
-    sodium:        missingToNull(nutrients.sodium),
-  };
+  return {};
 }
 
killedBy: nutrientsToIngredientColumns maps "missing" to null for all fields
statusReason: expected undefined to be null

[Killed] BlockStatement
src/lib/db/recipes.ts:56:72
   };
 }
 
-export function recipeRowToTotals(row: RecipeRow): IngredientNutrients {
-  return {
-    energy:       nullToMissing(row.total_energy),
-    protein:      nullToMissing(row.total_protein),
-    fat:          nullToMissing(row.total_fat),
-    saturatedFat: nullToMissing(row.total_saturated_fat),
-    carbs:        nullToMissing(row.total_carbs),
-    fiber:        nullToMissing(row.total_fiber),
-    sugars:       nullToMissing(row.total_sugars),
-    salt:         nullToMissing(row.total_salt),
-    sodium:       nullToMissing(row.total_sodium),
-  };
-}
+export function recipeRowToTotals(row: RecipeRow): IngredientNutrients {}
 
 export function totalsToRecipeColumns(totals: IngredientNutrients): TotalInsertColumns {
killedBy: recipeRowToTotals maps all null total fields to "missing"
statusReason: Cannot read properties of undefined (reading 'energy')

[Killed] BlockStatement
src/lib/db/recipes.ts:70:88
   };
 }
 
-export function totalsToRecipeColumns(totals: IngredientNutrients): TotalInsertColumns {
-  return {
-    total_energy:        missingToNull(totals.energy),
-    total_protein:       missingToNull(totals.protein),
-    total_fat:           missingToNull(totals.fat),
-    total_saturated_fat: missingToNull(totals.saturatedFat),
-    total_carbs:         missingToNull(totals.carbs),
-    total_fiber:         missingToNull(totals.fiber),
-    total_sugars:        missingToNull(totals.sugars),
-    total_salt:          missingToNull(totals.salt),
-    total_sodium:        missingToNull(totals.sodium),
-  };
-}
+export function totalsToRecipeColumns(totals: IngredientNutrients): TotalInsertColumns {}
 
killedBy: totalsToRecipeColumns maps "missing" to null for all total fields
statusReason: Cannot read properties of undefined (reading 'total_energy')
